Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: Before you can log in, you need to confirm your email address. We've sent you an email with a confirmation link in it. Just click the link and you'll be ready to go!
zu: Ngaphambi kokuba ulogele ukungena, kudingeka uqinisekise ikheli le-imeyli yakho. Sikuthumele i-imeyli nelinki yokuqinisekisa kuyona. Vele uchofoze ilinki uzobe usulungele ukuqala!

source: Before you connect to Twitter, you must sign in to Mozilla Support.
zu: Ngaphambi kokuxhuma ku-Twitter, kufanele usayinele ukungena ku-Mozilla Support.

source: Before you join, you need to give Army of Awesome the permission to post tweets on your behalf.
zu: Ngpahambi kokujoyina, kudingeka unikeze Ithimba Labaphambili imvume yokuphosta ama-tweet esikhundleni sakho.

source: Below is a list of items that you have watched. Checked items are items you are currently watching and unchecked items are no longer being watched.
zu: Ngezansi kunohla lwezinto ozibukile. Izinto ezinoqhwi eduze kwazo yilezi ozibukayo manje kanti lezo ezingenabo oqhwi yilezi ongasazibuki.

source: Be nice. Our volunteers are Mozilla users just like you, who take the time out of their day to help.
zu: Yiba nomusa. Amavolontiya ethu angabasebenzisi be-Mozilla njengawe, abathatha isikhathi sabo osukwini lwabo ukuze basize.

source: <b>Important:</b> Currently we are using a simplified model, where each article accounts for 1/50=2% of visits per language
zu: <b>Okubalulekile:</b> Njengamanje sisebenzisa imodeli ecaciswe kangcono, lapho i-athikhili ngayinye yakha ama-1/50=2% okuvakashelwa ngakunye ulimi ngalunye

source: Bio
zu: Umlando wakho

source: Biography
zu: Umlando

source: Body:
zu: Umzimba:

source: Bold
zu: Ngokugqamile

source: bold text
zu: umbhalo ogqamile

source: Bookmark options
zu: Izinketho zamabhukumaka

source: Bookmarks
zu: Amabhukumaka

source: Bookmarks and tabs
zu: Amabhukumaka

source: Briefly describe your changes:
zu: Chaza ngamafuphi izinguquko zakho:

source: Browse for an image to upload.
zu: Phequlula umfanekiso ozolodwa.

source: Browse for unsolved questions and help a fellow user
zu: Phequlula imibuzo engekasonjululwa usizo omunye umsebenzisi

source: Browse for unsolved questions and help a Firefox user
zu: Phequlula imibuzo engekasonjululwa bese usiza umsebenzisi we-Firefox

source: browserID
zu: i-browserID

source: Browse the questions for all the products together in one list.
zu: Phequlula imibuzo yayo yonke imikhiqizo ohlwini olulodwa.

source: Bulleted List
zu: Uhla olunamabhulethi

source: Bulleted list item
zu: Uhla olunezinto ezingamabhulethi

source: Button of type "%s" does not exist.
zu: Inkinobho yohlobo lwe"%s" ayikho.

source: by <a class="username" href="{profile_url}">{username}</a>
zu: ngu <a class="username" href="{profile_url}">{username}</a>

source: by <a href="{profile_url}">{user}</a>
zu: yenziwe <a href="{profile_url}">{user}</a>

source: by {user}
zu: yenziwe {user}

source: Calendar
zu: Ikhalenda

source: Calling and Contacts
zu: Ukufona kanye Nabafonelwayo

source: Cancel and go back to document history
zu: Khansela bese ubuyela emlandweni wedokhumenti

source: Cancel Review
zu: Khansela Isibukezo

source: cannedresponses
zu: izimpendulo esezilungisiwe

source: Canned Responses
zu: Izimpendulo ezisethiwe

source: Can't find an answer? Summarize your question in a sentence.
zu: Awuzitholi izimpendulo? Fingqa umbuzo wakho ube umusho.

source: Cast to your TV
zu: Thumela imifanekiso yedivayisi yakho ku-TV yakho

source: Category
zu: Isigaba

source: Category:
zu: Isiqephu:

source: change
zu: shintsha

source: Change
zu: Shintsha

source: Change avatar
zu: Shintsha i-avatar

source: Change Avatar
zu: Shintsha i-Avatar

source: change category
zu: shintsha isigaba

source: Changed
zu: Kuguquliwe

source: changed by {users}
zu: ishintshwe ngu {users}

source: Change email
zu: Shintsha i-imeyli

source: Change Email
zu: Shintsha I-imeyli

source: Change email address
zu: Shintsha ikheli le-imeyli

source: Change {group} group avatar
zu: Shintsha {group} i-avatar yeqembu

source: Change how Firefox handles videos, animations, music and other interactive content
zu: Shintsha indlela i-Firefox esebenza ngayo ngamavidiyo, imifuziselo, umculo kanye nolunye uhlobo lolwazi

source: Change my email
zu: Shintsha i-imeyli yami

source: Change my password
zu: Shintsha iphasiwedi yami

source: Change password
zu: Shintsha iphasiwedi

source: Change Password
zu: Shintsha Iphasiwedi

source: change product
zu: shintsha umkhiqizo

source: Change Revisions
zu: Shintsha Izibukezo

source: Changes:
zu: Izinguquko:

source: Changes Needed
zu: Izinguquko Ezidingekayo

source: Changes Not Ready For Localization
zu: Izinguquko Azikalungeli Ukwenziwa Njengezasendaweni

source: Change your email preferences
zu: Shintsha i-imeyli oyincamelayo

source: Change your email preferences:
zu: Shintsha okuncamelayo nge-imeyli yakho:

source: Change your history settings on Firefox for iOS
zu: Shintsha amasethingi omlando wakho ku-Firefox ye-iOS

source: characters remaining.
zu: izinhlamvu ezisele.

source: Chat and share
zu: Xoxa futhi wabelane

source: Check our documentation
zu: Bheka amadokhumenti ethu

source: Choose a tweet below
zu: Khetha i-tweet lapha ngezansi

source: Choose revisions to compare
zu: Khetha izibukezo zokuqhathanisa

source: Chosen solution
zu: Isisombululo esikhethiwe

source: Chosen Solution
zu: Isisombululo Esikhethiwe

source: City
zu: Idolobha

source: Click here to find out where to help.
zu: Chofoza lapha ukuze uthole ukuthi ungasiza kuphi.

source: Click here to verify your email address
zu: Chofoza lapha ukuze uqinisekise ikheli le-imeyli yakho

source: Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
zu: Ukuchofoza ukuthi Amukela kuzokwenza le veshini ibe bukhoma! Uyacelwa uke uthathe ithuba lokuqinisekisa ukuthi zonke izinketho ziyanemba.

source: Click on the empty box above this text.
zu: Chofoza ebhokisini elingenalutho elingenhla kombhalo.

source: Clickthrough rate
zu: Izinga labachofozabedlula

source: Click Through Rate %
zu: Izinga lokuchofoza %

source: Click to register.
zu: Chofoza ukuze ubhalise.

source: Click to sign in.
zu: Chofoza ukuze usayinele ukungena.

source: Close
zu: Vala

source: Close account and delete all profile information
zu: Vala i-akahwunti bese udilitha yonke imininingwane yephrofayela

source: Close Diff
zu: Vala Izinguquko

source: Collect and retain information only when it is necessary to a project or task.
zu: Koleka uphinde ugcine imininingwane kuphela uma kunesidingo kuphrojekthi noma emsebenzini.

source: Comment
zu: Ukuphawula

source: Comment:
zu: Ukuphawula:

source: Common responses
zu: Izimpendulo ezivamile

source: Community Discussion Only
zu: Ingxoxo Yomphakathi Kuphela

source: Community Discussions
zu: Izingxoxo zomphakathi

source: Community forums
zu: Ihabhu Yomphakathi

source: Community Hub
zu: Ihabhu Yomphakathi

source: Community Search Results
zu: Imiphumela Yokucinga Komphakathi

source: Compare Revisions
zu: Qhathanisa Izibukezo

source: Compare Revisions | {document}
zu: Qhathanisa Izibukezo | {document}

source: Compare Selected Revisions
zu: Qhathanisa Izibukezo Ezikhethiwe

source: Compare Selected Translations
zu: Qhathanisa Izihumusho Ezikhethiwe

source: Complete overview...
zu: Isifingqo esiphelele...

source: Confirmation email sent
zu: Ukuqinisekiswa kwe-imeyli ethunyelwe

source: Confirmation email sent successfully.
zu: I-imeyli yokuqinisekisa i-akhawunti ithunyelwe ngempumelelo.

source: Confirm password
zu: Qinisekisa iphasiwedi

source: Confirm registration
zu: Qinisekisa ukubhalisa

source: Confirm your subscription
zu: Qinisekisa ukubhalisela kwakho ukuthola izindaba

source: Confusing
zu: Kuyadida

source: Congratulations!
zu: Siyakuhalalisela!

source: Connect on video and share pages with your network
zu: Xhumana ngamavidiyo bese wabelana ngamakhasi nenethiwekhi yakho

source: Connect to your Twitter account
zu: Xhuma ku-akhawunti yakho ye-Twitter

source: Connect your Twitter account
zu: Xhuma i-akhawunti yakho ye-Twitter

source: Contacts
zu: Izinombolo zabangathintwa

source: Contact Us
zu: Sithinte

source: Content
zu: Okuqukethwe

source: Content:
zu: Okuqukethwe:

source: Content changes that don't require immediate translation
zu: Ukushintshwa kokubhaliwe okungadingi ukuhumushwa ngokushesha

source: Continue Uploading Media
zu: Qhubeka Ukuloda Imidiya

source: contributed
zu: babe negalelo

source: Contributed
zu: Ababe negalelo

source: Contributing to Webmaker
zu: Ukuba negalelo kuWebmaker

source: Contributions
zu: Amagalelo

source: Contributions in last 90 days: {count}
zu: Igalelo elenziwe ezinsukwini ezingama-90 ezidlule: {count}

source: Contributor articles
zu: Amathuluzi onegalelo

source: Contributor Forums
zu: Izithangami Zabanegalelo

source: Contributors
zu: Abanegalelo

source: Contributor Tools
zu: Amathuluzi Onegalelo

source: Control how your information is saved or tracked
zu: Lawula ukuthi imininingwane yakho ilondolozwa noma ilandelelwa kanjani

source: Control the information that Firefox saves
zu: Lawula ulwazi olulondolozwa yi-Firefox

source: Cookies
zu: Amakhukhi

source: Cookies and cache
zu: Ama-cookie ne-cache

source: Copy your personal information from one browser to another
zu: Kopisha imininingwane yakho kwesinye isiphequluli kuya kwesinye

source: Copy your personal information from one Thunderbird to another
zu: Kopisha imininingwane yakho kusuka kwenye i-Thunderbird kuya kwenye

source: Could not send a message to that email address.
zu: Asikwazanga ukuthumela umyalezo kuleli kheli le-imeyli.

source: Could not upload file. Please try again later.
zu: Ayiphumelelanga ukulayisha ifayela. Uyacelwa uphinde uzame emva kwesikhashana.

source: Could not upload your image.
zu: Umfanekiso awukwazanga ukulodwa.

source: {count} Active Contributors (last 90 days)
zu: {count} Abanegalelo Abasebenzayo (izinsuku ezingama-90 ezidlule)

source: Country
zu: Izwe

source: %(count)s view
zu: %(count)s umbono

source: {count} visitors in the past 30 days
zu: {count} izivakashi ezinsukwini ezingama-30 ezidlule

source: Crashes, errors and other issues
zu: Ukufa, amaphutha kanye nezinye izinkinga

source: crashes on youtube
zu: iyakhresha ku-youtube

source: Crash ID
zu: I-Crash ID

source: Crashing
zu: Iyakhresha

source: Create
zu: Yakha

source: Create a New Article | Knowledge Base
zu: Yakaha I-athikhili Entsha | Ulwazi Oluyisisekelo

source: Create a New Knowledge Base Article
zu: Yakaha I-athikhili Entsha |Yolwazi Oluyisisekelo

source: Create a new support account
zu: Yakha i-akhawunti yokweseka entsha

source: Create a new thread
zu: Yakha uchungechunge olusha

source: Create a new thread | {d} | Knowledge Base
zu: Yakha uchungechunge olusha | {d} | Ulwazi Oluyisisekelo

source: Create announcement
zu: Yakha isaziso

source: Create a support account
zu: Yakha i-akhawunti yokweseka

source: Create a support account.
zu: Yakha i-akhawunti yokweseka.

source: Created
zu: Yakhiwe

source: Created:
zu: Okusunguliwe:

source: Created by:
zu: Yakhiwe ngu:

source: Created date. Format: mm/dd/yy
zu: Usuku lokwenziwa. Ifomethi: mm/dd/yy

source: Created successfully
zu: Sakhiwe ngempumelelo

source: Create my account
zu: Yakha i-akhawunti yami

source: Creator
zu: Umsunguli

source: Creator:
zu: Umsunguli:

source: %(creator)s created a new revision to the document %(document_title)s.
zu: %(creator)s bakhe isibukezo esisha sedokhumenti %(document_title)s.

source: %(creator)s submitted a new revision to the document %(document_title)s.
zu: %(creator)s balethe isibukezo esisha sedokhumenti %(document_title)s.

source: Current
zu: Okwamanje

source: Current Content
zu: Okuqukethwe njengamanje

source: Current public revision:
zu: Isibukezo somphakathi njengamanje:

source: Current public translation:
zu: Isihumusho somphakathi samanje:

source: Customize canned replies - make each tweet unique
zu: Lungisa izimpendulo ezisethiwe - yenza i-tweet ngayinye yehluke

source: Customize controls, options and add-ons
zu: Lungisa izilawuli, izinketho kanye nokokwengezela

source: Customize controls, options, settings and preferences
zu: Lungisa izilawuli, izinketho, amasethingi nokuncanyelwayo

source: Customize Firefox with add-ons, plugins, and extensions
zu: Lungisa i-Firefox ngokwengezelelwayo, okupulagwayo, kanye nokwelula

source: Customize settings and preferences
zu: Lungisa izilawuli, izinketho, amasethingi nokuncanyelwayo

source: Customize this article
zu: Lungisa le athikhili

source: Customize Thunderbird with add-ons, plugins, and extensions
zu: Lungisa i-Thunderbird ngezinezezelo, okokupulagwa, kanye nokokwelula

source: Customize your screen on your Firefox OS device.
zu: Lungisa iskrini kudivayisi yakho ye-Firefox OS.

source: Daily
zu: Nsukuzonke

source: Daily Unique Visitors
zu: Izivakashi Zansukuzonke Ezihlukile

source: Date
zu: Usuku

source: Date and Time
zu: Usuku Nesikhathi

source: %(date)s by <a href="%(url)s">%(user)s</a>
zu: %(date)s <a href="%(url)s">%(user)s </a>

source: Days since last activity:
zu: Kusukela ngosuku lokugcina owagcina ngalo:

source: {d} Discussion
zu: {d} Ingxoxo

source: {d} Discussion | Knowledge Base
zu: {d} Ingxoxo | Ulwazi Oluyisisekelo

source: Deactivated by
zu: Usulwe ngu

source: Deactivated user
zu: Umsebenzisi usesuliwe

source: Deactivate this user
zu: Sula lo msebenzisi

source: Deactivate this user and mark all content as spam
zu: Sula lo msebenzisi bese uphawula konke okuqukethwe njenge-spam

source: Deactivation Log
zu: Ilogi Yokuyekisa Ukusebenza

source: Defective
zu: Kunephutha

source: Defense in Depth
zu: Ukuvikela Ngokubanzi

source: Defer
zu: Hlehlisa

source: Defer Revision
zu: Hlehlisa Isibukezo

source: Defer this Revision
zu: Hlehlisa lesi Sibukezo

source: Defer this Translation
zu: Hlehlisa lesi Sihumusho

source: Defer Translation
zu: Hlehlisa Isihumusho

source: Definition: L10n coverage is a measure of the percentage of our visitor base that get served with KB articles in their own language. It's calculated by taking into account the English top 50 weighted by the localization status of an article and the the number of visits for each locale.
zu: Incazelo: I-L10n coverage yisilinganiselo samaphesenti ezivakashi zethu ezithola ama-athikhili a-KB ngolimi lwazo. Libalwa ngokubuka awesiNgisi angama-50 aphambili kanye nesimo sama-athikhili aseguqulelwe kwezinye izilimi kanye nenai lokuvakashelwa kusayithi ngayinye.

source: Definition of contribution: edited 1+ article or has reviewed 1+ article
zu: Incazelo yegalelo: uhlele i-athikhili e-1+ noma ubukeze i-athikhili e-1+

source: Definition of contribution: edited 1+ non English article or has reviewed 1+ non English article.
zu: Incazelo yegalelo: uhlele i-athikhili e-non English e-1+ noma ubukeze i-athikhili e-non English e-1+.

source: Definition of contribution: replied to a tweet.
zu: Incazelo yabanegalelo: ophendule i-tweet.

source: Definition of contribution: wrote 10+ posts
zu: Incazelo yokulethiwe: kubhalwe amaphosta ayi-10+

source: Definition: Percentage of people searching who click on an item on the search results page.
zu: Incazelo: Iphesenti labantu abacingayo abachofoza kokuthile okusekhasini lemiphumela.

source: Definition: Percentage of questions that get an action within X hours
zu: Incazelo: Iphesenti lemibuzo ethola ukunakwa esikhathini esingamahora ayi-X

source: Definition: Percentage of threads that have answer marked as a solution
zu: Incazelo: Iphesenti lochungechunge olunezimpendulo eziphawulwe njengeziyisisombululo

source: Definition: Ratio of yes/total votes for KB articles, forum threads
zu: Incazelo: Ireshiyo ethi yebo/isamba esiphelele samavoti ama-athikhili e-KB, uchungechunge lwesithangami

source: Definition: The number of people who have contributed to non English KB versions in the last 30 days.
zu: Incazelo: Inani labantu ababe negalelo kuzinhlobo ze-non English KB ezinsukwini ezingama-30 ezidlule.

source: Definition: The number of people who have contributed to the Army of Awesome in the last 30 days.
zu: Incazelo: Inombolo yabantu ababe negalelo Kuthimba Labaphambili ezinsukwini ezingama-30 ezidlule.

source: Definition: The number of people who have contributed to the forums in the last 30 days.
zu: Incazelo: Inani labantu ababe negalelo ezithangamini ezinsukwini ezingama-30 ezidlule.

source: Definition: The number of people who have contributed to the KB in the last 30 days.
zu: Incazelo: Inani labantu ababe negalelo ku-KB ezinsukwini ezingama-30 ezidlule.

source: Delete answer
zu: Dilitha impendulo

source: Delete Answer | {t} | Firefox Support Forum
zu: Dilitha Impendulo | {t} | Isithangami Sokweseka Se-Firefox

source: Delete avatar
zu: Dilitha i-avatar

source: Delete Document
zu: Dilitha Idokhumenti

source: Delete Document | {document}
zu: Dilitha Idokhumenti | {document}

source: Delete {group} group avatar
zu: Dilitha {group} i-avatar yeqembbu

source: Delete image
zu: Dilitha umfanekiso

source: Delete image | {t} | Media Gallery
zu: Dilitha umfanekiso | {t} | Igalari Yemidiya

source: Delete message
zu: Dilitha umyalezo

source: Delete Message
zu: Dilitha umyalezo

source: Delete messages?
zu: Dilitha imiyalezo?

source: Delete My Account
zu: Dilitha i-akhawunti yami

source: Delete Post
zu: Dilitha Iphosti

source: Delete Post | {t} | {d} Discussion | Knowledge Base
zu: Dilitha iphosti | {t} | {d} Ingxoxo | Isisekelo Solwazi

source: Delete question
zu: Dilitha umbuzo

source: Delete Question | {t} | Firefox Support Forum
zu: Dilitha Umbuzo| {t} | Isithangami Sokweseka Se-Firefox

source: Delete Revision
zu: Dilitha Isibukezo

source: Delete Revision | {document}
zu: Dilitha Isibukezo | {document}

source: Delete Selected
zu: Dilitha Okukhethiwe

source: Delete selected images
zu: Dilitha imifanekiso ekhethiwe

source: Delete this document
zu: Dilitha le dokhumenti

source: Delete this image
zu: Dilitha lo mfanekiso

source: Delete this post
zu: Dilitha le phosti

source: Delete this question
zu: Dilitha lo mbuzo

source: Delete this revision
zu: Dilitha lesi sibukezo

source: Delete this thread
zu: Dilitha lolu chungechunge

source: Delete Thread
zu: Dilitha Uchungechunge

source: Delete Thread | {t} | {d} Discussion | Knowledge Base
zu: Dilitha Uchungechunge | {t} | {d} Ingxoxo | Ulwazi Oluyisisekelo

source: Delete video
zu: Dilitha ividiyo

source: Delete video | {t} | Media Gallery
zu: Dilitha ividiyo | {t} | Igalari Yemidiya

source: Deleting your account will prevent you from answering or posting questions in Mozilla Support. This action will clear your profile and cannot be restored again.
zu: Ukudilitha i-akhawunti yakho kuzokuvimbela ukuthi ukwazi ukuphendula noma uthumele imibuzo ku-Mozilla Support. Uma wenza lokhu imininingwane yakho ngeke isabuyiseleka futhi.

source: Describe your issue here.
zu: Chaza inkinga yakho lapha.

source: Description:
zu: Incazelo:

source: desktop
zu: i-desktop

source: Details
zu: Imininingwane

source: Device:
zu: Idivayisi:

source: Did not work as expected
zu: Ayisebenzanga njengoba bekulindelekile

source: Did this answer also help you? Did you find another post more helpful? Let other Firefox users know by voting next to the answer.
zu: Ingabe le mpendulo nayo ikusizile? Ingabe uthole enye iphosti iwusizo kakhulu? Yazisa abanye abasebenzisi be-Firefox ngokuvota eduze kwempendulo.

source: Did this reply solve your problem?
zu: Ingabe le mpendulo iyisombululile inkinga yakho?

source: Did you know that %(answerer)s is a Firefox user just like you? Get started helping other Firefox users by <a href="https://%(host)s/questions?filter=unsolved"> browsing questions</a> -- you might just make someone's day!
zu: Bewazi ukuthi %(answerer)s ungumsebenzisi we-Firefox njengawe? Qala nawe ukusiza abanye abasebenzisi be-Firefox ngokuba <a href="https://%(host)s/questions?filter=unsolved"> uphequlule imibuzo</a> -- ungasiza ukwenza usuku lomunye lube ngcono!

source: Did you know that %(answerer)s is a Firefox user just like you? Get started helping other Firefox users by browsing questions at https://%(host)s/questions?filter=unsolved -- you might just make someone's day!
zu: Bewazi ukuthi %(answerer)s bangabasebenzisi be-Firefox njengawe? Qala usize abanye abasebenzisi be-Firefox ngokufuna imibuzo lapha https://%(host)s/questions?filter=unsolved -- ungasiza ukwenza usuku lomunye lube ngcono!

source: Did you mean %s?
zu: Ingabe ubuqonde ukuthi %s?

source: Differences
zu: Okwehlukile

source: Discuss
zu: Xoxa

source: Discussion
zu: Ingxoxo

source: Discussion Forums
zu: Izithangami Zezingxoxo

source: Display
zu: Bonisa

source: Display and appearance
zu: Ukukhombisa nokubukeka

source: Display Badges
zu: Veza Amabheji

source: Display name
zu: Khombisa igama

source: Display your digital badges on your social networks, job sites and your own website.
zu: Veza amabheji akho adijithali ezinkundleni zokuxhumana, kumasayithi omsebenzi kanye nakuwebhusayithi yakho uqobo.

source: Do any of these articles answer your question?
zu: Ingabe ikhona kula ma-athikhili ephendula umbuzo wakho?

source: Document contributors
zu: Idokhumenti yabanegalelo

source: Document Deleted | {document}
zu: Idokhumenti Idilithiwe | {document}

source: Documents
zu: Amadokhumenti

source: Documents edited or translated
zu: Amadokhumenti ahleliwe noma ahunyushiwe

source: Documents that include "{title}"
zu: Amadokumenti abandakanya "{title}"

source: Documents that link to "{title}"
zu: Amadokhumenti alinka ne "{title}"

source: Documents that use "{title}" as a template
zu: Amadokumenti asebenzisa "{title}" njengethempulethi

source: Does this reply solve the problem?
zu: Ingabe le mpendulo iyayisombulula inkinga?

source: Do more with apps
zu: Yenza okuthe xaxa ngama-app

source: Done
zu: Kwenziwe

source: Done!
zu: Kuqediwe!

source: DONE
zu: KWENZIWE

source: Done! Your question is now posted on the Mozilla community support forum.
zu: Usuqedile! Umbuzo wakho manje usuphostwe kusithangami somphakathi sokweseka se-Mozilla.

source: Do not disclose personal user information without the users consent.
zu: Ungadaluli imininingwane yomsebenzisi ngaphandle kwemvume yakhe.

source: Don't filter
zu: Ungacwengi

source: Don't have an account? Register
zu: Awunayo i-akhawunti? Rejista

source: download
zu: dawuniloda

source: Download a fresh copy
zu: Dawuniloda ikhophi entsha

source: Download and install apps
zu: Dawuniloda ufakele ama-app

source: Download and Manage Apps
zu: Dawuniloda futhi Ulawulle ama-Apps

source: Download apps from the Marketplace
zu: Dawuniloda ama-apps e-Marketplace

source: Download, install and migration
zu: Ukudawuniloda, ukufakela kanye nokuthutha

source: Download, install and Migration
zu: Ukudawuniloda, ukufakela nokuThutha

source: Earn Badges
zu: Hlomula ngamabheji

source: Earn Badges for the skills you learn online and offline
zu: Hlomula Ngamabheji ngamakhono owafunde ku-inthanethi nanoma ungekho ku-inthanethi

source: Edit an answer
zu: Lungisa impendulo

source: Edit anyway
zu: Lungisa noma kunjalo

source: Edit a post
zu: Hlela iphosti

source: Edit a post | {t} | {d} Discussion | Knowledge Base
zu: Hlela iphosti | {t} | {d} Ingxoxo| Ulwazi Oluyisisekelo

source: Edit a Question
zu: Lungisa Umbuzo

source: Edit Article
zu: Lungisa i-athikhili

source: Edit article based on this revision
zu: Lungisa i-athikhili kule veshini

source: Edit Article | {document}
zu: Lungisa i-athikhili | {document}

source: Edit Content
zu: Lungisa Okuqukethwe

source: Edit contributors
zu: Lungisa abanegalelo

source: Edit Description
zu: Lungisa Incazelo

source: Edit details
zu: Lungisa imininingwane

source: Edit | {group} | Groups
zu: Hlela | {group} | Amaqembu

source: Edit group leaders
zu: Hlela iqembu labaholi

source: Edit group members
zu: Hlela amalungu eqembu
